---
title: ElementFilter
classe: Autodesk.Revit.DB.ElementFilter
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ElementFilter

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean Inverted { get; }` | `elementFilter.Inverted` | Boolean |
| `Boolean IsValidObject { get; }` | `elementFilter.IsValidObject` | Boolean |
| `Void Dispose()` | `elementFilter.Dispose()` | Void |
| `Boolean PassesFilter(Document, ElementId)` | `elementFilter.PassesFilter(document, id)` | Boolean |
| `Boolean PassesFilter(Element)` | `elementFilter.PassesFilter(element)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```